package com.keke.notebook.huawei;

/**
 * Created by KEKE on 2019/6/3
 */
public class Code_000_Index {

    /**
     * 001 -- 字符串最后一个单词的长度
     * 002 -- 计算字符个数
     * 003 -- 明明的随机数
     * 004 -- 字符串分割
     * 005 -- 进制转换
     * 006 -- 质数因子
     * 007 -- 取近似数
     * 008 -- 合并表记录
     * 009 -- 提取不重复的整数
     * 010 -- 字符个数统计
     * 011 -- 数字颠倒
     * 012 -- 字符串反转
     * 013 -- 句子逆序
     * 014 -- 字符串的连接最长路径查找
     * 015 -- 求int型数据在内存中存储时1的个数
     * 016 -- 购物单
     * 017 -- 坐标移动
     * 018 -- 识别有效的IP地址和掩码并进行分类统计
     * 019 -- 简单错误记录
     * 020 -- 密码验证合格程序
     */
}
